## Task 1: Import Libraries

In [2]:
import numpy as np 
import pandas as pd 
from datetime import timedelta
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler
import plotly.graph_objs as go

## Task 2: Load the Dataset

In [3]:
data=pd.read_csv('/usercode/customer_segmentation.csv')

## Task 3: Explore the Dataset

In [4]:
data.describe()

               index       Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  541909.000000  406829.000000
mean   270954.000000       9.552250       4.611114   15287.690570
std    156435.797851     218.081158      96.759853    1713.600303
min         0.000000  -80995.000000  -11062.060000   12346.000000
25%    135477.000000       1.000000       1.250000   13953.000000
50%    270954.000000       3.000000       2.080000   15152.000000
75%    406431.000000      10.000000       4.130000   16791.000000
max    541908.000000   80995.000000   38970.000000   18287.000000

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   index        541909 non-null  int64
 1   InvoiceNo    541909 non-null  object
 2   StockCode    541909 non-null  object
 3   Description  540455 non-null  object
 4   Quantity     541909 non-null  int64
 5   InvoiceDate  541909 non-null  object
 6   UnitPrice    541909 non-null  float64
 7   CustomerID   406829 non-null  float64
 8   Country      541909 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 37.2+ MB

## Task 4: Drop Unnecessary Columns

In [6]:
data.drop(columns=['index','StockCode','Description','Country'],inplace=True)

In [7]:
data.head()

  InvoiceNo  Quantity     InvoiceDate  UnitPrice  CustomerID
0    536365         6  12/1/2010 8:26       2.55     17850.0
1    536365         6  12/1/2010 8:26       3.39     17850.0
2    536365         8  12/1/2010 8:26       2.75     17850.0
3    536365         6  12/1/2010 8:26       3.39     17850.0
4    536365         6  12/1/2010 8:26       3.39     17850.0

## Task 5: Treat Missing Values

In [8]:
data.isna().sum()

InvoiceNo           0
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
dtype: int64

In [9]:
data.dropna(axis=0,inplace=True)
data.isna().sum()

InvoiceNo      0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
dtype: int64

## Task 6: Calculate Total Price per Item

In [10]:
data['Price']=data['UnitPrice']*data['Quantity']
data.head()

  InvoiceNo  Quantity     InvoiceDate  UnitPrice  CustomerID  Price
0    536365         6  12/1/2010 8:26       2.55     17850.0  15.30
1    536365         6  12/1/2010 8:26       3.39     17850.0  20.34
2    536365         8  12/1/2010 8:26       2.75     17850.0  22.00
3    536365         6  12/1/2010 8:26       3.39     17850.0  20.34
4    536365         6  12/1/2010 8:26       3.39     17850.0  20.34


## Task 7: Calculate Recency of the Purchase

In [11]:
purchase_recency=data.groupby('CustomerID',group_keys=True)['InvoiceDate'].agg(np.max).reset_index(name='Recency').apply(lambda x : x)

## Task 8: Apt the Column's Datatype

In [13]:
purchase_recency['Recency']=purchase_recency['Recency'].astype('datetime64[ns]')
snapchotDate=(purchase_recency['Recency'].max())+timedelta(days=1)
purchase_recency['Recency'].apply(lambda x : (snapchotDate-x).days)

0       326
1       130
2        75
3        19
4       310
       ...
4367    278
4368    181
4369    122
4370     95
4371    202
Name: Recency, Length: 4372, dtype: int64


## Task 9: Calculate the Purchase Frequency of Customer

In [16]:
purchase_frequency=data.groupby('CustomerID',group_keys=True)['CustomerID'].count().reset_index(name='Frequency').apply(lambda x : x)
purchase_frequency

      CustomerID  Frequency
0        12346.0          2
1        12347.0        182
2        12348.0         31
3        12349.0         73
4        12350.0         17
...          ...        ...
4367     18280.0         10
4368     18281.0          7
4369     18282.0         13
4370     18283.0        756
4371     18287.0         70

[4372 rows x 2 columns]

## Task 10: Calculate the Monetary Value per Customer

## Task 11: Prepare the Data

## Task 12: Find the Optimal value of K

## Task 13: Cluster the Data

## Task 14: Explore the Clusters

## Task 15: Visualize the Clusters